export const mockRpd = [
  {
    rpdId: "cb08o7",
    rpdName: "Операционные системы",
    direction: "Прикладная математика и информатика",
    code: "03.04.05",
    educLvl: "Магистратура",
    educForm: "Очная",
    year: "2023",
    protocol: "25.05",
    date: "25.55.55",
    surname: "Спиридонов",
    name: "Максим",
    fName: "Евгеньевич",
    goals:
      "Цель дисциплины – приобретение студентами теоретических знаний современных\nоперационных систем, их назначения, функциях, структуре и принципов работы. Основное\nвнимание уделяется изучению ОС семейства Windows и UNIX (LINUX).\nТаким образом, целями освоения данной дисциплины являются:\n— знание основ функционирования и структуры современных операционных систем.\n— способность использовать средства операционных систем в разработке и\nэксплуатации информационных систем.\n— формирование профессиональных компетенций в области разработки\nинформационных систем в соответствии с требованиями ФГОС ВО по данному направлению\nподготовки.\n",
    tasks: "Что то",
    objectives:
      "Объектами профессиональной деятельности в рамках изучаемой дисциплины (модуля)\nявляются:\nГлавным объектом профессиональной деятельности в рамках изучаемой дисциплины\nявляются электронно-вычислительные машины (далее - ЭВМ), комплексы, системы и сети",
    disciplinePlace: "Обязательное",
    semester: 3,
    course: "2",
    competencies: [
      {
        id: "df3dc4ba-8b59-44ea-a38a-43e72fd930a1",
        code: "ОПК - 1",
        name: "Знание",
        achievementIndicators: [
          {
            id: "735f5bc7-b9ad-4e57-819f-cb671510a9ed",
            code: "И(ОПК - 1) -1 ",
            wording: "Да",
            knowledges: "З(ОПК-1) Знание",
            skills: "У(ОПК-1) Умение",
            masterys: "В(ОПК-1) Владение",
          },
        ],
      },
    ],
    hours: "148",
    creditUnits: "2",
    sectionsTopics: "уцйу",
    smthElse: "5",
    supportList: "Перечент",
    fundList: "Перечень учебно-методического обеспечения\n\n",
    literatureList: "Перечень литературы\n\n",
    periodicalsList: "Периодические издания\n\n",
    internetResList:
      "Перечень ресурсов информационно-телекоммуникационной сети «Интернет»\n\n",
    infoTechResList:
      "Перечень информационных технологий, используемых при осуществлении образовательного процесса, включая программное обеспечение, информационные справочные системы (при необходимости)\n\n",
    profDataInfList:
      "Профессиональные базы данных и информационные справочные системы\n\n",
    reqSoftwareList: "Необходимое программное обеспечение\n\n",
    TReqLogistics: {
      lecture: "Необходимое материально-техническое для лекционных занятий\n\n",
      seminars:
        "Необходимое материально-техническое для семинарских занятий\n\n",
      disabled:
        "Необходимое материально-техническое для лиц с ограничеными возможностями здоровья\n\n",
    },
  },
  {
    rpdId: "cb0dgaao7",
    rpdName: "Тестировка прикладных систем",
    direction: "Прикладная математика и информатика",
    code: "03.04.05",
    educLvl: "Магистратура",
    educForm: "Очная",
    year: "2023",
    protocol: "25.05",
    date: "25.55.55",
    surname: "Петров",
    name: "Иван",
    fName: "Иванович",
    goals:
      "Цель дисциплины – приобретение студентами теоретических знаний современных\nоперационных систем, их назначения, функциях, структуре и принципов работы. Основное\nвнимание уделяется изучению ОС семейства Windows и UNIX (LINUX).\nТаким образом, целями освоения данной дисциплины являются:\n— знание основ функционирования и структуры современных операционных систем.\n— способность использовать средства операционных систем в разработке и\nэксплуатации информационных систем.\n— формирование профессиональных компетенций в области разработки\nинформационных систем в соответствии с требованиями ФГОС ВО по данному направлению\nподготовки.\n",
    tasks: "Что то",
    objectives:
      "Объектами профессиональной деятельности в рамках изучаемой дисциплины (модуля)\nявляются:\nГлавным объектом профессиональной деятельности в рамках изучаемой дисциплины\nявляются электронно-вычислительные машины (далее - ЭВМ), комплексы, системы и сети",
    disciplinePlace: "Обязательное",
    semester: 3,
    course: "2",
    competencies: [
      {
        id: "df3dc4ba-8b59-44ea-a38a-43e72fd930a1",
        code: "ОПК - 1",
        name: "Знание",
        achievementIndicators: [
          {
            id: "735f5bc7-b9ad-4e57-819f-cb671510a9ed",
            code: "И(ОПК - 1) -1 ",
            wording: "Да",
            knowledges: "З(ОПК-1) Знание",
            skills: "У(ОПК-1) Умение",
            masterys: "В(ОПК-1) Владение",
          },
        ],
      },
    ],
    hours: "148",
    creditUnits: "2",
    sectionsTopics: "уцйу",
    smthElse: "5",
    supportList: "Перечент",
    fundList: "Перечень учебно-методического обеспечения\n\n",
    literatureList: "Перечень литературы\n\n",
    periodicalsList: "Периодические издания\n\n",
    internetResList:
      "Перечень ресурсов информационно-телекоммуникационной сети «Интернет»\n\n",
    infoTechResList:
      "Перечень информационных технологий, используемых при осуществлении образовательного процесса, включая программное обеспечение, информационные справочные системы (при необходимости)\n\n",
    profDataInfList:
      "Профессиональные базы данных и информационные справочные системы\n\n",
    reqSoftwareList: "Необходимое программное обеспечение\n\n",
    TReqLogistics: {
      lecture: "Необходимое материально-техническое для лекционных занятий\n\n",
      seminars:
        "Необходимое материально-техническое для семинарских занятий\n\n",
      disabled:
        "Необходимое материально-техническое для лиц с ограничеными возможностями здоровья\n\n",
    },
  },
  {
    rpdId: "af965",
    rpdName: "Объектно-ориентированное программирование",
    direction: "Прикладная математика и информатика",
    code: "03.04.05",
    educLvl: "Бакалавриат",
    educForm: "Очная",
    year: "2023",
    protocol: "25.05",
    date: "25.55.55",
    surname: "Васьков",
    name: "Данил",
    fName: "Олегович",
    goals:
      "Цель дисциплины – приобретение студентами теоретических знаний современных\nоперационных систем, их назначения, функциях, структуре и принципов работы. Основное\nвнимание уделяется изучению ОС семейства Windows и UNIX (LINUX).\nТаким образом, целями освоения данной дисциплины являются:\n— знание основ функционирования и структуры современных операционных систем.\n— способность использовать средства операционных систем в разработке и\nэксплуатации информационных систем.\n— формирование профессиональных компетенций в области разработки\nинформационных систем в соответствии с требованиями ФГОС ВО по данному направлению\nподготовки.\n",
    tasks: "Что то",
    objectives:
      "Объектами профессиональной деятельности в рамках изучаемой дисциплины (модуля)\nявляются:\nГлавным объектом профессиональной деятельности в рамках изучаемой дисциплины\nявляются электронно-вычислительные машины (далее - ЭВМ), комплексы, системы и сети",
    disciplinePlace: "Обязательное",
    semester: 3,
    course: "2",
    competencies: [
      {
        id: "df3dc4ba-8b59-44ea-a38a-43e72fd930a1",
        code: "ОПК - 1",
        name: "Знание",
        achievementIndicators: [
          {
            id: "735f5bc7-b9ad-4e57-819f-cb671510a9ed",
            code: "И(ОПК - 1) -1 ",
            wording: "Да",
            knowledges: "З(ОПК-1) Знание",
            skills: "У(ОПК-1) Умение",
            masterys: "В(ОПК-1) Владение",
          },
        ],
      },
    ],
    hours: "148",
    creditUnits: "2",
    sectionsTopics: "уцйу",
    smthElse: "5",
    supportList: "Перечент",
    fundList: "Перечень учебно-методического обеспечения\n\n",
    literatureList: "Перечень литературы\n\n",
    periodicalsList: "Периодические издания\n\n",
    internetResList:
      "Перечень ресурсов информационно-телекоммуникационной сети «Интернет»\n\n",
    infoTechResList:
      "Перечень информационных технологий, используемых при осуществлении образовательного процесса, включая программное обеспечение, информационные справочные системы (при необходимости)\n\n",
    profDataInfList:
      "Профессиональные базы данных и информационные справочные системы\n\n",
    reqSoftwareList: "Необходимое программное обеспечение\n\n",
    TReqLogistics: {
      lecture: "Необходимое материально-техническое для лекционных занятий\n\n",
      seminars:
        "Необходимое материально-техническое для семинарских занятий\n\n",
      disabled:
        "Необходимое материально-техническое для лиц с ограничеными возможностями здоровья\n\n",
    },
  },
  {
    rpdId: "aseiov55",
    rpdName: "Социология",
    direction: "Прикладная математика и информатика",
    code: "03.04.05",
    educLvl: "Магистратура",
    educForm: "Очная",
    year: "2023",
    protocol: "25.05",
    date: "25.55.55",
    surname: "Спиридонов",
    name: "Лев",
    fName: "Евгеньевич",
    goals:
      "Цель дисциплины – приобретение студентами теоретических знаний современных\nоперационных систем, их назначения, функциях, структуре и принципов работы. Основное\nвнимание уделяется изучению ОС семейства Windows и UNIX (LINUX).\nТаким образом, целями освоения данной дисциплины являются:\n— знание основ функционирования и структуры современных операционных систем.\n— способность использовать средства операционных систем в разработке и\nэксплуатации информационных систем.\n— формирование профессиональных компетенций в области разработки\nинформационных систем в соответствии с требованиями ФГОС ВО по данному направлению\nподготовки.\n",
    tasks: "Что то",
    objectives:
      "Объектами профессиональной деятельности в рамках изучаемой дисциплины (модуля)\nявляются:\nГлавным объектом профессиональной деятельности в рамках изучаемой дисциплины\nявляются электронно-вычислительные машины (далее - ЭВМ), комплексы, системы и сети",
    disciplinePlace: "Обязательное",
    semester: 3,
    course: "2",
    competencies: [
      {
        id: "df3dc4ba-8b59-44ea-a38a-43e72fd930a1",
        code: "ОПК - 1",
        name: "Знание",
        achievementIndicators: [
          {
            id: "735f5bc7-b9ad-4e57-819f-cb671510a9ed",
            code: "И(ОПК - 1) -1 ",
            wording: "Да",
            knowledges: "З(ОПК-1) Знание",
            skills: "У(ОПК-1) Умение",
            masterys: "В(ОПК-1) Владение",
          },
        ],
      },
    ],
    hours: "148",
    creditUnits: "2",
    sectionsTopics: "уцйу",
    smthElse: "5",
    supportList: "Перечент",
    fundList: "Перечень учебно-методического обеспечения\n\n",
    literatureList: "Перечень литературы\n\n",
    periodicalsList: "Периодические издания\n\n",
    internetResList:
      "Перечень ресурсов информационно-телекоммуникационной сети «Интернет»\n\n",
    infoTechResList:
      "Перечень информационных технологий, используемых при осуществлении образовательного процесса, включая программное обеспечение, информационные справочные системы (при необходимости)\n\n",
    profDataInfList:
      "Профессиональные базы данных и информационные справочные системы\n\n",
    reqSoftwareList: "Необходимое программное обеспечение\n\n",
    TReqLogistics: {
      lecture: "Необходимое материально-техническое для лекционных занятий\n\n",
      seminars:
        "Необходимое материально-техническое для семинарских занятий\n\n",
      disabled:
        "Необходимое материально-техническое для лиц с ограничеными возможностями здоровья\n\n",
    },
  },
  {
    rpdId: "asmmp421",
    rpdName: "Философия",
    direction: "Прикладная математика и информатика",
    code: "03.04.05",
    educLvl: "Магистратура",
    educForm: "Очная",
    year: "2023",
    protocol: "25.05",
    date: "25.55.55",
    surname: "Баева",
    name: "Валерия",
    fName: "Олеговна",
    goals:
      "Цель дисциплины – приобретение студентами теоретических знаний современных\nоперационных систем, их назначения, функциях, структуре и принципов работы. Основное\nвнимание уделяется изучению ОС семейства Windows и UNIX (LINUX).\nТаким образом, целями освоения данной дисциплины являются:\n— знание основ функционирования и структуры современных операционных систем.\n— способность использовать средства операционных систем в разработке и\nэксплуатации информационных систем.\n— формирование профессиональных компетенций в области разработки\nинформационных систем в соответствии с требованиями ФГОС ВО по данному направлению\nподготовки.\n",
    tasks: "Что то",
    objectives:
      "Объектами профессиональной деятельности в рамках изучаемой дисциплины (модуля)\nявляются:\nГлавным объектом профессиональной деятельности в рамках изучаемой дисциплины\nявляются электронно-вычислительные машины (далее - ЭВМ), комплексы, системы и сети",
    disciplinePlace: "Обязательное",
    semester: 3,
    course: "2",
    competencies: [
      {
        id: "df3dc4ba-8b59-44ea-a38a-43e72fd930a1",
        code: "ОПК - 1",
        name: "Знание",
        achievementIndicators: [
          {
            id: "735f5bc7-b9ad-4e57-819f-cb671510a9ed",
            code: "И(ОПК - 1) -1 ",
            wording: "Да",
            knowledges: "З(ОПК-1) Знание",
            skills: "У(ОПК-1) Умение",
            masterys: "В(ОПК-1) Владение",
          },
        ],
      },
    ],
    hours: "148",
    creditUnits: "2",
    sectionsTopics: "уцйу",
    smthElse: "5",
    supportList: "Перечент",
    fundList: "Перечень учебно-методического обеспечения\n\n",
    literatureList: "Перечень литературы\n\n",
    periodicalsList: "Периодические издания\n\n",
    internetResList:
      "Перечень ресурсов информационно-телекоммуникационной сети «Интернет»\n\n",
    infoTechResList:
      "Перечень информационных технологий, используемых при осуществлении образовательного процесса, включая программное обеспечение, информационные справочные системы (при необходимости)\n\n",
    profDataInfList:
      "Профессиональные базы данных и информационные справочные системы\n\n",
    reqSoftwareList: "Необходимое программное обеспечение\n\n",
    TReqLogistics: {
      lecture: "Необходимое материально-техническое для лекционных занятий\n\n",
      seminars:
        "Необходимое материально-техническое для семинарских занятий\n\n",
      disabled:
        "Необходимое материально-техническое для лиц с ограничеными возможностями здоровья\n\n",
    },
  },
  {
    rpdId: "cb08o7",
    rpdName: "Вычислительная электротехника",
    direction: "Прикладная математика и информатика",
    code: "03.04.05",
    educLvl: "Бакалавриат",
    educForm: "Очная",
    year: "2023",
    protocol: "25.05",
    date: "25.55.55",
    surname: "Ветров",
    name: "Евгений",
    fName: "Владиславочич",
    goals:
      "Цель дисциплины – приобретение студентами теоретических знаний современных\nоперационных систем, их назначения, функциях, структуре и принципов работы. Основное\nвнимание уделяется изучению ОС семейства Windows и UNIX (LINUX).\nТаким образом, целями освоения данной дисциплины являются:\n— знание основ функционирования и структуры современных операционных систем.\n— способность использовать средства операционных систем в разработке и\nэксплуатации информационных систем.\n— формирование профессиональных компетенций в области разработки\nинформационных систем в соответствии с требованиями ФГОС ВО по данному направлению\nподготовки.\n",
    tasks: "Что то",
    objectives:
      "Объектами профессиональной деятельности в рамках изучаемой дисциплины (модуля)\nявляются:\nГлавным объектом профессиональной деятельности в рамках изучаемой дисциплины\nявляются электронно-вычислительные машины (далее - ЭВМ), комплексы, системы и сети",
    disciplinePlace: "Обязательное",
    semester: 3,
    course: "2",
    competencies: [
      {
        id: "df3dc4ba-8b59-44ea-a38a-43e72fd930a1",
        code: "ОПК - 1",
        name: "Знание",
        achievementIndicators: [
          {
            id: "735f5bc7-b9ad-4e57-819f-cb671510a9ed",
            code: "И(ОПК - 1) -1 ",
            wording: "Да",
            knowledges: "З(ОПК-1) Знание",
            skills: "У(ОПК-1) Умение",
            masterys: "В(ОПК-1) Владение",
          },
        ],
      },
    ],
    hours: "148",
    creditUnits: "2",
    sectionsTopics: "уцйу",
    smthElse: "5",
    supportList: "Перечент",
    fundList: "Перечень учебно-методического обеспечения\n\n",
    literatureList: "Перечень литературы\n\n",
    periodicalsList: "Периодические издания\n\n",
    internetResList:
      "Перечень ресурсов информационно-телекоммуникационной сети «Интернет»\n\n",
    infoTechResList:
      "Перечень информационных технологий, используемых при осуществлении образовательного процесса, включая программное обеспечение, информационные справочные системы (при необходимости)\n\n",
    profDataInfList:
      "Профессиональные базы данных и информационные справочные системы\n\n",
    reqSoftwareList: "Необходимое программное обеспечение\n\n",
    TReqLogistics: {
      lecture: "Необходимое материально-техническое для лекционных занятий\n\n",
      seminars:
        "Необходимое материально-техническое для семинарских занятий\n\n",
      disabled:
        "Необходимое материально-техническое для лиц с ограничеными возможностями здоровья\n\n",
    },
  },
];
